Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512GM306.h
#define AD2CSSH AD2CSSH
extern volatile unsigned int  AD2CSSH __attribute__((__sfr__));
typedef struct tagAD2CSSHBITS {
  unsigned CSS16:1;
  unsigned CSS17:1;
  unsigned CSS18:1;
  unsigned CSS19:1;
  unsigned CSS20:1;
  unsigned CSS21:1;
  unsigned CSS22:1;
  unsigned CSS23:1;
  unsigned CSS24:1;
  unsigned CSS25:1;
  unsigned CSS26:1;
  unsigned CSS27:1;
  unsigned CSS28:1;
  unsigned CSS29:1;
  unsigned CSS30:1;
  unsigned CSS31:1;
} AD2CSSHBITS;
extern volatile AD2CSSHBITS AD2CSSHbits __attribute__((__sfr__));

#define AD2CSSL AD2CSSL
extern volatile unsigned int  AD2CSSL __attribute__((__sfr__));
typedef struct tagAD2CSSLBITS {
  unsigned CSS0:1;
  unsigned CSS1:1;
  unsigned CSS2:1;
  unsigned CSS3:1;
  unsigned CSS4:1;
  unsigned CSS5:1;
  unsigned CSS6:1;
  unsigned CSS7:1;
  unsigned CSS8:1;
  unsigned CSS9:1;
  unsigned CSS10:1;
  unsigned CSS11:1;
  unsigned CSS12:1;
  unsigned CSS13:1;
  unsigned CSS14:1;
  unsigned CSS15:1;
} AD2CSSLBITS;
extern volatile AD2CSSLBITS AD2CSSLbits __attribute__((__sfr__));

#define AD2CON4 AD2CON4
extern volatile unsigned int  AD2CON4 __attribute__((__sfr__));
__extension__ typedef struct tagAD2CON4BITS {
  union {
    struct {
      unsigned DMABL:3;
      unsigned :5;
      unsigned ADDMAEN:1;
    };
    struct {
      unsigned DMABL0:1;
      unsigned DMABL1:1;
      unsigned DMABL2:1;
    };
  };
} AD2CON4BITS;
extern volatile AD2CON4BITS AD2CON4bits __attribute__((__sfr__));

#define QEI2CON QEI2CON
extern volatile unsigned int  QEI2CON __attribute__((__sfr__));
typedef struct tagQEI2CONBITS {
  unsigned CCM:2;
  unsigned GATEN:1;
  unsigned CNTPOL:1;
  unsigned INTDIV:3;
  unsigned :1;
  unsigned IMV:2;
  unsigned PIMOD:3;
  unsigned QEISIDL:1;
  unsigned :1;
  unsigned QEIEN:1;
} QEI2CONBITS;
extern volatile QEI2CONBITS QEI2CONbits __attribute__((__sfr__));

#define QEI2IOC QEI2IOC
extern volatile unsigned int  QEI2IOC __attribute__((__sfr__));
typedef struct tagQEI2IOCBITS {
  unsigned QEA:1;
  unsigned QEB:1;
  unsigned INDEX:1;
  unsigned HOME:1;
  unsigned QEAPOL:1;
  unsigned QEBPOL:1;
  unsigned IDXPOL:1;
  unsigned HOMPOL:1;
  unsigned SWPAB:1;
  unsigned OUTFNC:2;
  unsigned QFDIV:3;
  unsigned FLTREN:1;
  unsigned QCAPEN:1;
} QEI2IOCBITS;
extern volatile QEI2IOCBITS QEI2IOCbits __attribute__((__sfr__));

#define QEI2STAT QEI2STAT
extern volatile unsigned int  QEI2STAT __attribute__((__sfr__));
typedef struct tagQEI2STATBITS {
  unsigned IDXIEN:1;
  unsigned IDXIRQ:1;
  unsigned HOMIEN:1;
  unsigned HOMIRQ:1;
  unsigned VELOVIEN:1;
  unsigned VELOVIRQ:1;
  unsigned PCIIEN:1;
  unsigned PCIIRQ:1;
  unsigned POSOVIEN:1;
  unsigned POSOVIRQ:1;
  unsigned PCLEQIEN:1;
  unsigned PCLEQIRQ:1;
  unsigned PCHEQIEN:1;
  unsigned PCHEQIRQ:1;
} QEI2STATBITS;
extern volatile QEI2STATBITS QEI2STATbits __attribute__((__sfr__));

#define POS2CNTL POS2CNTL
extern volatile unsigned int  POS2CNTL __attribute__((__sfr__));
#define POS2CNTH POS2CNTH
extern volatile unsigned int  POS2CNTH __attribute__((__sfr__));
#define POS2HLD POS2HLD
extern volatile unsigned int  POS2HLD __attribute__((__sfr__));
#define VEL2CNT VEL2CNT
extern volatile unsigned int  VEL2CNT __attribute__((__sfr__));
#define INT2TMRL INT2TMRL
extern volatile unsigned int  INT2TMRL __attribute__((__sfr__));
#define INT2TMRH INT2TMRH
extern volatile unsigned int  INT2TMRH __attribute__((__sfr__));
#define INT2HLDL INT2HLDL
extern volatile unsigned int  INT2HLDL __attribute__((__sfr__));
#define INT2HLDH INT2HLDH
extern volatile unsigned int  INT2HLDH __attribute__((__sfr__));
#define INDX2CNTL INDX2CNTL
extern volatile unsigned int  INDX2CNTL __attribute__((__sfr__));
#define INDX2CNTH INDX2CNTH
extern volatile unsigned int  INDX2CNTH __attribute__((__sfr__));
#define INDX2HLD INDX2HLD
extern volatile unsigned int  INDX2HLD __attribute__((__sfr__));
#define QEI2GECL QEI2GECL
extern volatile unsigned int  QEI2GECL __attribute__((__sfr__));
#define QEI2ICL QEI2ICL
extern volatile unsigned int  QEI2ICL __attribute__((__sfr__));
#define QEI2GECH QEI2GECH
extern volatile unsigned int  QEI2GECH __attribute__((__sfr__));
#define QEI2ICH QEI2ICH
extern volatile unsigned int  QEI2ICH __attribute__((__sfr__));
#define QEI2LECL QEI2LECL
extern volatile unsigned int  QEI2LECL __attribute__((__sfr__));
#define QEI2LECH QEI2LECH
extern volatile unsigned int  QEI2LECH __attribute__((__sfr__));
#define PMCON PMCON
extern volatile unsigned int  PMCON __attribute__((__sfr__));
__extension__ typedef struct tagPMCONBITS {
  union {
    struct {
      unsigned RDSP:1;
      unsigned WRSP:1;
      unsigned BEP:1;
      unsigned CS1P:1;
      unsigned CS2P:1;
      unsigned ALP:1;
      unsigned CSF:2;
      unsigned PTRDEN:1;
      unsigned PTWREN:1;
      unsigned PTBEEN:1;
      unsigned ADRMUX:2;
      unsigned PSIDL:1;
      unsigned :1;
      unsigned PMPEN:1;
    };
    struct {
      unsigned :6;
      unsigned CSF0:1;
      unsigned CSF1:1;
      unsigned :3;
      unsigned ADRMUX0:1;
      unsigned ADRMUX1:1;
    };
  };
} PMCONBITS;
extern volatile PMCONBITS PMCONbits __attribute__((__sfr__));

#define PMMODE PMMODE
extern volatile unsigned int  PMMODE __attribute__((__sfr__));
__extension__ typedef struct tagPMMODEBITS {
  union {
    struct {
      unsigned WAITE:2;
      unsigned WAITM:4;
      unsigned WAITB:2;
      unsigned MODE:2;
      unsigned MODE16:1;
      unsigned INCM:2;
      unsigned IRQM:2;
      unsigned BUSY:1;
    };
    struct {
      unsigned WAITE0:1;
      unsigned WAITE1:1;
      unsigned WAITM0:1;
      unsigned WAITM1:1;
      unsigned WAITM2:1;
      unsigned WAITM3:1;
      unsigned WAITB0:1;
      unsigned WAITB1:1;
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :1;
      unsigned INCM0:1;
      unsigned INCM1:1;
      unsigned IRQM0:1;
      unsigned IRQM1:1;
    };
  };
} PMMODEBITS;
extern volatile PMMODEBITS PMMODEbits __attribute__((__sfr__));

#define PMADDR PMADDR
extern volatile unsigned int  PMADDR __attribute__((__sfr__));
__extension__ typedef struct tagPMADDRBITS {
  union {
    struct {
      unsigned ADDR:14;
      unsigned CS1:1;
      unsigned CS2:1;
    };
    struct {
      unsigned ADDR0:1;
      unsigned ADDR1:1;
      unsigned ADDR2:1;
      unsigned ADDR3:1;
      unsigned ADDR4:1;
      unsigned ADDR5:1;
      unsigned ADDR6:1;
      unsigned ADDR7:1;
      unsigned ADDR8:1;
      unsigned ADDR9:1;
      unsigned ADDR10:1;
      unsigned ADDR11:1;
      unsigned ADDR12:1;
      unsigned ADDR13:1;
    };
  };
} PMADDRBITS;
